<?php function content($data) { ?>
<a href="#" id="residence" class="anchor"></a>
<h3>Бесплатное проживание</h3>

<p>Всем иногородним студентам и школьникам, а также тренеру или руководителю бесплатно предоставляется место <strong>в гостинице «Кварт», расположенной по адресу Пр. Победы, д. 21.</strong></p>

<p>
    <iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d2245.4958119607954!2d49.20507479999999!3d55.749888799999994!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x415eae75c0e304dd%3A0x9826874571ae2088!2z0L_RgC4g0J_QvtCx0LXQtNGLLCAyMSwg0JrQsNC30LDQvdGMLCDQoNC10YHQvy4g0KLQsNGC0LDRgNGB0YLQsNC9LCA0MjAxMzg!5e0!3m2!1sru!2sru!4v1423491430621" width="400" height="300" frameborder="0" style="border:0"></iframe>
</p>

<p>Рядом:</p>

<ol><li>станция метро «Проспект Победы»;</li>
<li>МакДоналдс;</li>
<li>кафе «Биляр»;</li>
<li>торговый центр «Проспект Победы».</li></ol>

<a href="#" id="transport" class="anchor"></a>
<h3>Транспортное обслуживание</h3>

<p class="message"><strong>Раздел изменился, прочтите внимательно.</strong></p>

<p>В этом году трансфер от вокзала или аэропорта до гостиницы (и обратно) предоставляется только командам из дальнего зарубежья. </p>

<p>Всем иногородним участникам будет обеспечен трансфер от гостиницы до места проведения Турнира и обратно.</p>

<a href="#" id="food" class="anchor"></a>
<h3>Бесплатное питание для участников Турнира</h3>

    <p>В месте проведения Турнира предоставляется:
    
    <ul>
        <li>казанским участникам &mdash; обед;</li>
        <li>иногородним &mdash; обед и ужин.</li>
    </ul>
    
    <p>В гостинице «Кварт» иногородним участникам предоставляется завтрак перед посадкой в автобусы и отправлением на место проведения Турнира. Также в день заезда в гостиницу предоставляется на выбор обед или ужин (нужно взять талон у администратора).
        
<a href="#" id="invitation" class="anchor"></a>
<h3 style="margin-top:16px;">Подтверждение участия и официальное приглашение</h3>

<p>Все приглашённые на Турнир команды должны подтвердить свое участие, заполнив анкету. 

<p>Если вам требуется официальное приглашение для оформления командировки, необходимо сообщить должность и ФИО лица, на чье имя оформляется приглашение (как правило, руководитель учебного заведения), наименование учебного заведения, состав команды и предпочтительный способ пересылки приглашения (факс, скан-копия на e-mail). Сделать это можно через анкету. 
    
<p><strong>Анкета будет опубликована после окончания отборочного тура.</strong>

<?php } ?>