<?php function content($data) { ?>
<a href="#" id="residence" class="anchor"></a>
<h3>Ѕесплатное проживание</h3>

<p>¬сем иногородним студентам и школьникам, а также тренеру или руководителю (пожалуйста, заранее сообщите организаторам о его прибытии) бесплатно предоставл€етс€ место в одной из гостиниц нашего города.  акой именно &mdash; сейчас уточн€етс€; следите за обновлени€ми информации.

<a href="#" id="transport" class="anchor"></a>
<h3>“ранспортное обслуживание</h3>

<p>ћы встретим вас по прибытии в город, чтобы с комфортом доставить до места проживани€. ƒл€ этого нужно в нашей анкете сообщить номер поезда или рейса самолета, врем€ прибыти€, количество прибывающих, а также контактный телефон дл€ св€зи. ƒо места проведени€ турнира и обратно в гостиницу вас отвезут на автобусе. —сылка на анкету будет приведена позднее.

<a href="#" id="food" class="anchor"></a>
<h3>ѕитание</h3>

<p>ƒл€ иногородних участников турнира &mdash; бесплатный обед и ужин. »нформаци€ о завтраках в гостинице будет опубликована позднее.

<?php } ?>
