<?php function content($data) { ?>
<a href="#" id="residence" class="anchor"></a>
<h3>Бесплатное проживание</h3>

<p>Всем иногородним студентам и школьникам, а также тренеру или руководителю (пожалуйста, заранее сообщите организаторам о его прибытии) бесплатно предоставляется место <strong>в гостинице «Кварт», расположенной по адресу Пр. Победы, д. 21.</strong></p>

<p>
    <iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d2245.4958119607954!2d49.20507479999999!3d55.749888799999994!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x415eae75c0e304dd%3A0x9826874571ae2088!2z0L_RgC4g0J_QvtCx0LXQtNGLLCAyMSwg0JrQsNC30LDQvdGMLCDQoNC10YHQvy4g0KLQsNGC0LDRgNGB0YLQsNC9LCA0MjAxMzg!5e0!3m2!1sru!2sru!4v1423491430621" width="400" height="300" frameborder="0" style="border:0"></iframe>
</p>

<p>Рядом:</p>

<ol><li>станция метро «Проспект Победы»;</li>
<li>МакДоналдс;</li>
<li>кафе «Биляр»;</li>
<li>торговый центр «Проспект Победы».</li></ol>

<!--p><strong>или в санатории-профилактории при КФУ (общежитие №1), ул. Красной Позиции, д. 6.</strong></p>

<p>
    <iframe width="425" height="350" frameborder="0" scrolling="no" marginheight="0" marginwidth="0" src="http://maps.google.ru/maps?q=%D0%BA%D1%80%D0%B0%D1%81%D0%BD%D0%B0%D1%8F+%D0%BF%D0%BE%D0%B7%D0%B8%D1%86%D0%B8%D1%8F+%D0%B4.+6&amp;ie=UTF8&amp;hq=&amp;hnear=%D1%83%D0%BB.+%D0%9A%D1%80%D0%B0%D1%81%D0%BD%D0%BE%D0%B9+%D0%9F%D0%BE%D0%B7%D0%B8%D1%86%D0%B8%D0%B8,+6,+%D0%9A%D0%B0%D0%B7%D0%B0%D0%BD%D1%8C&amp;ll=55.789093,49.164955&amp;spn=0.003849,0.011362&amp;t=m&amp;z=14&amp;output=embed"></iframe>
</p-->

<a href="#" id="transport" class="anchor"></a>
<h3>Транспортное обслуживание</h3>

<p>Мы встретим вас по прибытии в город, чтобы с комфортом доставить до места проживания. Для этого нужно в нашей анкете сообщить номер поезда, время прибытия, количество прибывающих, а также контактный телефон для связи. <strong>Анкета будет опубликована после окончания отборочного тура.</strong>

<p>До места проведения турнира и обратно в гостиницу вас отвезут на автобусе.</p>

<a href="#" id="food" class="anchor"></a>
<h3>Питание</h3>

<p>Для иногородних участников турнира – бесплатный обед и ужин. Позавтракать бесплатно вы сможете на следующий день после поселения в гостинице «Кварт» (администратор выдаст талон на завтрак или обед, или ужин по желанию).</p>

<a href="#" id="invitation" class="anchor"></a>
<h3 style="margin-top:16px;">Приглашение</h3>

<p>Официальное письмо с приглашением на турнир (для оформления командировочных) будет выслано участникам по запросу. Для этого необходимо сообщить в анкете должность и ФИО лица, на чье имя оформляется приглашение (как правило, руководитель учебного заведения), наименование учебного заведения, состав команды и предпочтительный способ пересылки приглашения (факс, скан-копия на e-mail). <strong>Анкета будет опубликована после окончания отборочного тура.</strong></p>

<?php } ?>
