<?php function content($data) { ?>

<a href="#" id="notes" class="anchor"></a>
<h3>Новости</h3>

<p class="message"><strong>Опубликованы <a href="./history.php#2015">тексты задач и архив с решениями</a></strong></p>

<p>15 марта в Казани прошел ежегодный (уже 15-й) <a href="./files/monitor2015.html">открытый командный турнир по программированию</a> среди студентов и школьников Республики Татарстан. 

<p>Было проверено <strong>восемьсот тридцать четыре</strong> решения, написанных <strong>ста тридцатью четырьмя</strong> участниками из <strong>сорока пяти</strong> команд по <strong>семнадцати</strong> различным задачам за <strong>пять</strong> часов. Абсолютным победителем стала <a href="https://vk.com/photo-1413270_356911327"><strong>команда Университета ИТМО #1 (Санкт-Петербург)</a></strong>: Борис Минаев, Артём Васильев, Геннадий Короткевич. Тренер &mdash; А.С. Станкевич.

<a href="https://vk.com/photo-1413270_356911334"><img style="margin:1em 0;width:300px;" src="https://pp.vk.me/c623617/v623617506/2424f/MQt6yAcEaK8.jpg" /></a>

<p><strong>Второе место в студенческом зачёте заняла команда <a href="https://vk.com/photo-1413270_356911317">"Tapirs", Московский государственный университет им. М.В. Ломоносова</a></strong>: Глеб Евстропов, Михаил Пядеркин, Виктор Омельяненко. Тренер &mdash; А.Е.&nbsp;Панкратьев.

<p><strong>Третье место в студенческом зачёте заняла команда <a href="https://vk.com/photo-1413270_356911306">"Dandelion", Уральский государственный университет им. Б.Н. Ельцина (Екатеринбург)</a></strong>: Никита Сивухин, Олег Меркурьев, Алексей Данилюк</a>. Тренер &mdash; М.В.&nbsp;Рубинчик.</li>

<p><strong>Премию Президента Республики как лучшей студенческой команде Татарстана выиграла команда #1 Казанского (Приволжского) федерального университета</strong>: Рамис Ямилов, Владимир Бутин, Динар Гайнитдинов. Тренер &mdash; К.Р. Хадиев. 

<p><strong>Первое место в школьном зачёте заняла команда <a href="https://vk.com/photo-1413270_356911017">ЧУ ДО "Школа программистов" (Мытищи)</a></strong>: Денис Солонков, Илья Павлов, Андрей Поповкин. Тренеры &mdash; Т.Р. Хисматуллин, Д.А. Кузьмичёв, С.В. Шедов.
            
<a href="https://vk.com/photo-1413270_356911017"><img style="margin:1em 0;width:300px;" src="https://pp.vk.me/c623617/v623617506/24210/wa6I7g3oAnQ.jpg" /></a>

<p><strong>Второе место в школьном зачёте и премию Президента Республики как лучшей школьной команде Татарстана выиграла <a href="https://vk.com/photo-1413270_356911002">команда №2 Лицея им. Н.И. Лобачевского при К(П)ФУ (Казань)</a></strong>: Асхат Сахабиев, Дмитрий Захаров, Исмагил Сайфутдинов. Тренер &mdash; С.И. Михайлин. 

<p><strong>Третье место в школьном зачёте заняла <a href="https://vk.com/photo-1413270_356910998">команда №1 Лицея им. Н.И. Лобачевского при К(П)ФУ (Казань)</a></strong>: Семён Лагутин, Кирилл Муравьев, Максим Круглов. Тренер &mdash; С.И. Михайлин.

<p>Призёрами турнира стали:

    <ul><li><strong>"Trinity"</strong>, Московский государственный университет им. М.В. Ломоносова &mdash; диплом II степени;</li>
        <li><strong>Нижегородский государственный университет</strong>&nbsp;им. Н.И. Лобачевского &mdash; диплом II степени;</li>
        <li><strong>"Jinotega"</strong>, Московский физико-технический институт &mdash; диплом II степени;</li>
        <li><strong>Университет ИТМО #3</strong> (Санкт-Петербург) &mdash; диплом III степени;</li>
        <li><strong>"Unknown"</strong>, Московский физико-технический институт &mdash; диплом III степени;</li>
        <li><strong>"42+1"</strong>, Саратовский государственный университет им. Н.Г. Чернышевского &mdash; диплом III степени;</li>
        <br /><br />
        <li><strong>"Li2"</strong>, Лицей-интернат №2 (Казань) &mdash; диплом I степени;</li>
        <li><strong>Mathematical Grammar School</strong> (Белград, Сербия) &mdash; диплом II степени;</li>
        <li><strong>"Lunar Eclipse"</strong>, Специализированный учебно-научный центр УРФУ (Екатеринбург) &mdash; диплом II степени;</li>
        <li><strong>"High School"</strong>, Лицей №165, Школа №187, Лицей №40 (Нижний Новгород) &mdash; диплом II степени;</li>
        <li><strong>"GorniyKIT"</strong>, Лицей №41 (Ижевск) &mdash; диплом II степени;</li>
        <li><strong>"НЧ-26-10"</strong>, Гимназия №26 (Набережные Челны) &mdash; диплом III степени;</li>
        <li><strong>"Shumwun Speshal"</strong>, Природо-математическая гимназия "Нанчо Попович" (Шумен, Болгария) &mdash; диплом III степени.</li>
    </ul>

<p><strong>Самое быстрое решение</strong> (7 минут 28 секунд) выполнила команда Университета ИТМО #1. Кстати, второе по скорости решение принадлежит третьей команде этого же университета (7 минут 29 секунд). <strong>Последнее успешное решение</strong> (4 часа 58 минут 42 секунды) осталось за первой командой Лицея им. Н.И. Лобачевского при К(П)ФУ. <strong>Самой упорной</strong> оказалась команда "ANI" Гимназии №122 (Казань), сдавшая правильное решений одной из задач после 22 неудачных попыток. А <strong>самым юным участником</strong> оказался Дан Шарафутдинов, представлявший Лицей №1 г. Салавата. На момент проведения соревнований ему исполнилось 10 лет.

<p><strong>Развлекательный тур</strong> "Hardcoreder'2015" выиграла команда Университета ИТМО #3. Несмотря на то, что правила Hardcoreder сильно отличались от правил ACM, мы также решили наградить бонусным призом команду, занявшую первое место в таблице <strong>Hardcoreder по правилам ACM</strong>. Этой командой стали ученики Университетского лицея из Петрозаводска.

<p>Надеемся, что наш турнир вам понравился. До встречи в следующем году!
<br />
<img src="https://pp.vk.me/c623617/v623617506/2407b/EzZ3jqkYr-c.jpg" style="margin:1em 0;width:300px;" />

<!--p>Команда может состоять из трех студентов (кроме "ветеранов" ACM-движения) либо школьников. Отбор команд будет производиться на основе <del>Гран-при Саратова</del> Гран-при Карелии и Гран-при Удмуртии в рамках <a href="http://opencup.ru">Открытого кубка по программированию</a>. 

<p class="message" style="width:350px;">Отбор среди студентов из-за пределов Татарстана производится в первом дивизионе. Отбор среди всех прочих команд &mdash; во втором дивизионе Открытого кубка. Частные случаи (например, школьная команда, выступающая в первом дивизионе) рассматриваются отдельно по согласованию с оргкомитетом.

<p>Если вы уже участвуете в OpenCup — милости просим. Если ничего о нем не знаете — мы вышлем вам логин и пароль, а в день самого отбора (или ранее) опубликуем ссылку для входа в соревнование. Зарегистрироваться на отбор вы можете через <a href="https://docs.google.com/forms/d/1qWKOrGbM74L9lPC92Gxv9AWk0Fat6-kPAHU0MkRB8qQ/viewform" target="_blank">специальную форму</a>.-->

<!--p>Как обычно, проживание участников и питание оплачиваются компанией-организатором, АйСиЭл КПО-ВС.

<p>В программе — первый день с открытием, пробным туром, экскурсиями и (на сладкое) развлекательным туром в уже знакомом формате (условий нет, есть только тесты, которые выдаются по одному каждую минуту).

<p>Второй день полностью посвящен 5-часовому контесту, разбору задач и вручению призов. Стеклянного дождя на закрытии в этом году не будет, потому что мы переезжаем в высотный корпус Казанского федерального университета.

<p>Информация по размерам квот и отбору размещена в <a href="./qualification.php">разделе об отборочном туре.-->

<a href="#" id="about" class="anchor"></a>
<h3>О Турнире</h3>
<p>Турнир ICL – это открытый чемпионат Татарстана по спортивному программированию среди школьников и студентов,  проводимый Министерством образования и науки Республики Татарстан, ОАО «АйСиЭл&mdash;КПО ВС» при содействии Казанского IT-парка, Казанского (Приволжского) федерального университета, Казанского национального исследовательского технического университета имени А. Н. Туполева. </p>
<p class="message" style="width:350px;"><strong>Для того чтобы принять участие турнире, вы должны</strong></p>
<ul>
<li>собрать команду из трех школьников или студентов;</li>
<li>заполнить <a href="https://docs.google.com/forms/d/1qWKOrGbM74L9lPC92Gxv9AWk0Fat6-kPAHU0MkRB8qQ/viewform" target="_blank">форму регистрации на отборочный тур</a>;</li>
<li>принять участие в <a href="qualification.php">отборочном туре</a>, и по его итогам удовлетворить критериям отбора на Турнир.</li>
</ul>

<p>Правила проведения основного тура близки к правилам командного чемпионата мира по программированию среди студентов ACM. За пять часов команде из трех человек предлагается решить набор задач (обычно 10-12) на одном из разрешенных на турнире языков программирования. Успешное решение задач помимо знания собственно языков программирования предполагает математическую подготовку, знание алгоритмов и структур данных, а также слаженную командную работу в условиях дефицита времени. Проверка решений производится автоматической тестирующей системой.</p>

<!--p>Турнир'2015 пройдет в здании второго корпуса К(П)ФУ.</p>

<p>
    <iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d4486.184989262956!2d49.122028005374396!3d55.79163178709444!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x415ead11537bce5b%3A0x13a254f9171b54a2!2z0JLRgtC-0YDQvtC5INCy0YvRgdC-0YLQvdGL0Lkg0JrQvtGA0L_Rg9GBINCa0LDQt9Cw0L3RgdC60L7Qs9C-INCk0LXQtNC10YDQsNC70YzQvdC-0LPQviDQo9C90LjQstC10YDRgdC40YLQtdGC0LA!5e0!3m2!1sru!2sru!4v1423484740592" width="400" height="300" frameborder="0" style="border:0"></iframe>
</p-->

<a href="#" id="timetable" class="anchor"></a>
<h3>расписание турнира</h3>
<table>
<tr><th>Дата</th>
<th>Событие</th></tr>
<tr><td>15 февраля, воскресенье<br />11:00&mdash;16:00 MSK</td>
<td>Отборочный тур, контест A</td></tr>
<tr><td>22 февраля, воскресенье<br />11:00&mdash;16:00 MSK</td>
<td>Отборочный тур, контест B</td></tr>
<tr><td>24 февраля, вторник &mdash;<br />
25 февраля, среда</td>
<td>Объявление результатов отбора</td></tr>
<!--tr><td>14 марта, суббота</td>
<td>Открытие и пробный тур</td></tr>
<tr><td>15 марта, всокресенье</td>
<td>Основной тур и закрытие</td></tr-->
<tr><th colspan="2">14 марта, суббота (время московское)</th></tr>
<tr>
    <td>9.00&mdash;10.00</td>
    <td>Регистрация (фойе второго корпуса КФУ)</td>
</tr>
<tr>
    <td>10.00&mdash;11.00</td>
    <td>Открытие турнира (библиотека КФУ)</td>
</tr>
<tr>
    <td>11.00&mdash;11.30</td>
    <td>Брифинг для участников, пробный тур (13-й этаж второго корпуса КФУ)</td>
</tr>
<tr>
    <td>11.30&mdash;12.00</td>
    <td>Чайный перерыв</td>
</tr>
<tr>
    <td>12.00&mdash;14.00</td>
    <td>Развлекательный тур (13-й этаж второго корпуса КФУ)</td>
</tr>
<tr>
    <td>14.00&mdash;15.30</td>
    <td>Обед</td>
</tr>
<tr>
    <td>15.30&mdash;18.30</td>
    <td>Экскурсия для иногородних участников турнира по Кремлю</td>
</tr>
<tr>
    <td>18.30&mdash;19.00</td>
    <td>Ужин для иногородних участников турнира</td>
</tr>
<tr>
    <td>19.00</td>
    <td>Отъезд иногородних участников турнира к месту проживания</td>
</tr>



<tr><th colspan="2">15 марта, воскресенье (время московское) </th></tr>
<tr>
    <td>9.00&mdash;14.00</td>
    <td>Основной тур</td>
</tr>
<tr>
    <td>10.30&mdash;11.00</td>
    <td>Чайный перерыв</td>
</tr>
<tr>
    <td>13.00&mdash;13.30</td>
    <td>Обед для тренеров/руководителей команд</td>
</tr>
<tr>
    <td>14.00&mdash;15.30</td>
    <td>Обед участников турнира</td>
</tr>
<tr>
    <td>15.30&mdash;16.30</td>
    <td>Разбор задач</td>
</tr>
<tr>
    <td>16.30&mdash;18.30</td>
    <td>Объявление результатов, вручение призов, официальное закрытие</td>
</tr>
<tr>
    <td>18.30&mdash;19.00</td>
    <td>Ужин для иногородних участников турнира</td>
</tr>
<tr>
    <td>19.00</td>
    <td>Отъезд иногородних участников турнира к месту проживания</td>
</tr>





</table>
<p></p>

<a href="#" id="partners" class="anchor"></a>
<h3 style="margin-top:16px;">Партнеры</h3>
<div style="transform:scale(0.60);transform-origin:0 0">
    <p style="width:400px;"><a href="http://mic.tatarstan.ru/" style="float:left;margin-right:50px;"><img src="./graphic/logo.mis.small.png" alt="Министерство информатизации и связи РТ" width="188" height="188" /></a><a href="http://itpark-kazan.ru" style="float:left;"><img src="./graphic/logo.it.park.png" alt="Казанский IT-парк" width="162" height="226" /></a></p>
    <p style="clear:both;"><a href="http://www.microsoft.com/rus/"><img src="./graphic/microsoft.jpg" alt="Microsoft" width="466" height="88" style="vertical-align:middle;" /></a></p>
    <p><a href="http://www.intel.com/#/ru_RU_05"><img src="./graphic/intel.jpg" alt="Intel Channel Partner 2010" width="225" height="150" style="vertical-align:middle;" /><a></p>
    <p><a href="http://www.kpfu.ru"><img src="./graphic/logo.kfu.jpg" alt="Казанский (Приволжский) федеральный университет" width="400" height="271" /></a></p>
    <p><a href="http://www.kai.ru"><img src="./graphic/logo.knitu.jpg" alt="Казанский национальный исследовательский технический университет им. А.Н.Туполева" width="400" height="176" /></a></p>
    <!--p><a href="http://www.kgeu.ru"><img src="./graphic/logo.kgeu.png" alt="Казанский государственный энергетический университет" width="450" height="221" /></a></p-->
    <!--p><a href="http://www.kp.ru/"><img src="./graphic/logo.kp.png" alt="Комсомольская правда" width="450" height="89" /></a></p-->
    <p><a href="http://www.rt-online.ru"><img src="./graphic/logo.rt.newspaper.jpg" alt="Газета Республика Татарстан" width="450" height="152" /></a></p>
    <p><a href="http://ku.kpfu.ru"><img src="./graphic/logo.ku.kpfu.png" alt="Газета Казанский университет" width="450" height="97" /></a></p>
    <p><img src="./graphic/logo.darelfonyn.png" width="450" height="85" /></a></p>
    <!--p><a href="http://universmotri.ru"><img src="./graphic/logo.universmotri.ru.png" alt="Студенческое телевидение КФУ" width="450" height="172" /></a></p-->
    <!--p><a href="http://www.moltat.ru"><img src="./graphic/moltat.jpg" alt="Молодежь Татарстана" width="400" height="146" /></a></p>
    <p><a href="http://www.prokazan.ru"><img src="./graphic/prokazan.jpg" alt="ProKazan.ru" width="314" height="241" /></a></p-->
</div>
<?php } ?>
