<?php function content($data) { ?>

<a href="#" id="notes" class="anchor"></a>
<h3>Новости</h3>

<p class="message" style="width:350px;"><strong>ICL'16 &mdash; 13 марта. Обновлено</strong>
    
<p>13 марта 2016 года пройдет очередной Турнир ICL. Это соревнование станет уже шестнадцатым по счёту.
    
<p>Участники Турнира определятся по итогам заочного отборочного тура, который будет проведен на базе одного из этапов <a href="opencup.ru">Открытого кубка по программированию</a> (либо 14, либо 21 февраля). День проведения отбора будет уточнён в ближайшее время. 
    
<p>Команда-победитель основного тура увезёт домой главный приз &mdash; три ультрабука производства ОАО &laquo;АйСиЭл&mdash;КПО ВС&raquo;. 
    
<p>В программу Турнира входит небольшое развлекательное состязание в первый день. Это будет уже знакомый HardCoreDer: &laquo;угадай задачу по тестам и успей решить её раньше соперника по паре&raquo;. 
    
<p>Как обычно, питание и проживание иногородних участников оплачивается организаторами.
    
<p class="message" style="width:350px;"><strong>Для того чтобы принять участие в Турнире, вы должны:</strong></p>
<ul>
    <li>собрать команду из 3 школьников или 3 студентов;</li>
    <li>если ваша команда не имеет <a href="./qualification.php#wildcard">специального приглашения</a>:
        <ul>
            <li>заполнить <a href="https://docs.google.com/forms/d/1Pj_4BbNjzBjC-DCe5qkIL6cFRBV-ATdZnbllzdUUXIk/viewform" target="_blank">форму регистрации на отборочный тур</a> до наступления дня его проведения. Тур будет проведен либо 14, либо 21 февраля;</li>
            <li>пройти <a href="qualification.php">отборочный тур</a>;</li>
        </ul>
    <li>в случае попадания в основной тур (в результате отбора либо по специальному приглашению) в срок до 29 февраля включительно заполнить анкету подтверждения участия (одна на команду) и анкету участника (на каждого из членов команды).</li>
</ul>

<p>Ссылки на анкету подтверждения участия и анкету участника будут опубликованы вскоре после окончания отборочного тура.

<p><img src="http://cs623617.vk.me/v623617506/2407b/EzZ3jqkYr-c.jpg" style="width:350px;" />

<a href="#" id="about" class="anchor"></a>
<h3>О Турнире</h3>
<p>Турнир ICL – это открытый чемпионат Татарстана по спортивному программированию среди школьников и студентов,  проводимый Министерством образования и науки Республики Татарстан, ОАО «АйСиЭл&mdash;КПО ВС» при содействии Казанского IT-парка, Казанского (Приволжского) федерального университета, Казанского национального исследовательского технического университета имени А. Н. Туполева. </p>

<p>Правила проведения основного тура близки к правилам командного чемпионата мира по программированию среди студентов ACM. За пять часов команде из трех человек предлагается решить набор задач на одном из разрешенных на турнире языков программирования. Успешное решение задач помимо знания собственно языков программирования предполагает математическую подготовку, знание алгоритмов и структур данных, а также слаженную командную работу в условиях дефицита времени. Проверка решений производится автоматической тестирующей системой.</p>

<a href="#" id="timetable" class="anchor"></a>
<h3>расписание турнира</h3>
<table>
<tr><th>Дата</th>
<th>Событие</th></tr>
<!--tr><td>15 февраля, воскресенье<br />11:00&mdash;16:00 MSK</td>
<td>Отборочный тур, контест A</td></tr>
<tr><td>22 февраля, воскресенье<br />11:00&mdash;16:00 MSK</td>
<td>Отборочный тур, контест B</td></tr>
<tr><td>24 февраля, вторник &mdash;<br />
25 февраля, среда</td>
<td>Объявление результатов отбора</td></tr-->
<tr><td>12 марта, суббота</td>
<td>Открытие и пробный тур</td></tr>
<tr><td>13 марта, всокресенье</td>
<td>Основной тур и закрытие</td></tr>
<!--tr><th colspan="2">14 марта, суббота (время московское)</th></tr>
<tr>
    <td>9.00&mdash;10.00</td>
    <td>Регистрация (фойе второго корпуса КФУ)</td>
</tr>
<tr>
    <td>10.00&mdash;11.00</td>
    <td>Открытие турнира (библиотека КФУ)</td>
</tr>
<tr>
    <td>11.00&mdash;11.30</td>
    <td>Брифинг для участников, пробный тур (13-й этаж второго корпуса КФУ)</td>
</tr>
<tr>
    <td>11.30&mdash;12.00</td>
    <td>Чайный перерыв</td>
</tr>
<tr>
    <td>12.00&mdash;14.00</td>
    <td>Развлекательный тур (13-й этаж второго корпуса КФУ)</td>
</tr>
<tr>
    <td>14.00&mdash;15.30</td>
    <td>Обед</td>
</tr>
<tr>
    <td>15.30&mdash;18.30</td>
    <td>Экскурсия для иногородних участников турнира по Кремлю</td>
</tr>
<tr>
    <td>18.30&mdash;19.00</td>
    <td>Ужин для иногородних участников турнира</td>
</tr>
<tr>
    <td>19.00</td>
    <td>Отъезд иногородних участников турнира к месту проживания</td>
</tr>



<tr><th colspan="2">15 марта, воскресенье (время московское) </th></tr>
<tr>
    <td>9.00&mdash;14.00</td>
    <td>Основной тур</td>
</tr>
<tr>
    <td>10.30&mdash;11.00</td>
    <td>Чайный перерыв</td>
</tr>
<tr>
    <td>13.00&mdash;13.30</td>
    <td>Обед для тренеров/руководителей команд</td>
</tr>
<tr>
    <td>14.00&mdash;15.30</td>
    <td>Обед участников турнира</td>
</tr>
<tr>
    <td>15.30&mdash;16.30</td>
    <td>Разбор задач</td>
</tr>
<tr>
    <td>16.30&mdash;18.30</td>
    <td>Объявление результатов, вручение призов, официальное закрытие</td>
</tr>
<tr>
    <td>18.30&mdash;19.00</td>
    <td>Ужин для иногородних участников турнира</td>
</tr>
<tr>
    <td>19.00</td>
    <td>Отъезд иногородних участников турнира к месту проживания</td>
</tr-->





</table>
<p></p>

<a href="#" id="partners" class="anchor"></a>
<h3 style="margin-top:16px;">Партнеры</h3>
<div style="transform:scale(0.60);transform-origin:0 0">
    <p style="width:400px;"><a href="http://mic.tatarstan.ru/" style="float:left;margin-right:50px;"><img src="./graphic/logo.mis.small.png" alt="Министерство информатизации и связи РТ" width="188" height="188" /></a><a href="http://itpark-kazan.ru" style="float:left;"><img src="./graphic/logo.it.park.png" alt="Казанский IT-парк" width="162" height="226" /></a></p>
    <p style="clear:both;"><a href="http://www.microsoft.com/rus/"><img src="./graphic/microsoft.jpg" alt="Microsoft" width="466" height="88" style="vertical-align:middle;" /></a></p>
    <p><a href="http://www.intel.com/#/ru_RU_05"><img src="./graphic/intel.jpg" alt="Intel Channel Partner 2010" width="225" height="150" style="vertical-align:middle;" /><a></p>
    <p><a href="http://www.kpfu.ru"><img src="./graphic/logo.kfu.jpg" alt="Казанский (Приволжский) федеральный университет" width="400" height="271" /></a></p>
    <p><a href="http://www.kai.ru"><img src="./graphic/logo.knitu.jpg" alt="Казанский национальный исследовательский технический университет им. А.Н.Туполева" width="400" height="176" /></a></p>
    <!--p><a href="http://www.kgeu.ru"><img src="./graphic/logo.kgeu.png" alt="Казанский государственный энергетический университет" width="450" height="221" /></a></p-->
    <!--p><a href="http://www.kp.ru/"><img src="./graphic/logo.kp.png" alt="Комсомольская правда" width="450" height="89" /></a></p-->
    <p><a href="http://www.rt-online.ru"><img src="./graphic/logo.rt.newspaper.jpg" alt="Газета Республика Татарстан" width="450" height="152" /></a></p>
    <p><a href="http://ku.kpfu.ru"><img src="./graphic/logo.ku.kpfu.png" alt="Газета Казанский университет" width="450" height="97" /></a></p>
    <p><img src="./graphic/logo.darelfonyn.png" width="450" height="85" /></a></p>
    <!--p><a href="http://universmotri.ru"><img src="./graphic/logo.universmotri.ru.png" alt="Студенческое телевидение КФУ" width="450" height="172" /></a></p-->
    <!--p><a href="http://www.moltat.ru"><img src="./graphic/moltat.jpg" alt="Молодежь Татарстана" width="400" height="146" /></a></p>
    <p><a href="http://www.prokazan.ru"><img src="./graphic/prokazan.jpg" alt="ProKazan.ru" width="314" height="241" /></a></p-->
</div>
<?php } ?>
